Table of Contents
 Enum SupportTypeInDirrection
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Type opf support in the direction
public enum SupportTypeInDirrection
Fields
Flexible = 2
Flexible support (Flexible Stiffness is present)
FlexiblePressOnly = 4
Nonlinear flexible press only
Free = 1
Free support (no support defined)
Rigid = 0
Rigid support
RigidPressOnly = 3
Nonlinear press only
Fields
 Name |  Description
 Flexible = 2
Flexible support (Flexible Stiffness is present)
 FlexiblePressOnly = 4
Nonlinear flexible press only
 Free = 1
Free support (no support defined)
 Rigid = 0
Rigid support
 RigidPressOnly = 3
Nonlinear press only
 Edit this page